using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Задание3
{
    /*а) Написать программу, которая подсчитывает расстояние между точками с координатами x1, y1 и x2,y2
      по формуле r=Math.Sqrt(Math.Pow(x2-x1,2)+Math.Pow(y2-y1,2).
      Вывести результат, используя спецификатор формата .2f (с двумя знаками после запятой);
      б) *Выполнить предыдущее задание, оформив вычисления расстояния между точками в виде метода.*/

    class Program
    {
        static void Main(string[] args)
        {
            Console.Write("Введите координаты первой точки: ");


            Console.Write("Введите координаты второй точки: ");


        }
    }
}
